//
// Created by Artyom on 08.10.2023.
//

#ifndef BASICS_OF_PROGRAMMING_LABORATORY_WORK_1_H
#define BASICS_OF_PROGRAMMING_LABORATORY_WORK_1_H

/*
 * Минуты до Нового года 1283A codeforces
 *
 * Новый год уже на подходе и вы настолько взволнованы, что хотите узнать, сколько минут до него
 * осталось. Вы знаете, что сейчас часы показывают время «h часов, m минут», где 0 ≤ hh < 24 и
 * 0 ≤ mm < 60.
 * Ваша задача — найти количество минут до Нового года! Вы знаете, что Новый год наступит, когда часы
 * покажут 0 часов и 0 минут.
 * Вам необходимо ответить на t независимых наборов входных данных.
 */
void task_1();

/*
 * Опять двадцать пять! 630A codeforces
 *
 * HR-менеджер опять был расстроен. Очередной кандидат так же провалил собеседование, как и 24
 * предыдущих. «Неужели я даю такое сложное задание? — думал HR-менеджер. — Всего лишь возвести число
 * 5 в степень n и узнать последние две цифры числа. Да, конечно, n может быть большим, и на
 * калькуляторе такую степень не посчитать, но нам и нужны люди, способные думать, а не только
 * инструкции исполнять.»
 * А вы смогли бы пройти собеседование в компании, занимающейся машинным зрением в ИТ-граде?
 */
void task_2();

/*
 * Игра 513A codeforces
 *
 * Два игрока играют в простую игру. У каждого игрока есть коробка с шарами, причем коробка первого
 * игрока содержит ровно n_1 шаров, а коробка второго игрока содержит ровно n_2 шаров. За один ход
 * первый игрок может взять от 1 до k_1 шаров из своей коробки и выкинуть их. Аналогичным образом, за
 * один ход второй игрок может взять от 1 до k_2 шаров из своей коробки и выкинуть их. Игроки ходят по
 * очереди и первый игрок начинает игру. Проигрывает тот, кто не может сделать ход. Ваша задача
 * определить, кто выигрывает игру, если оба игрока совершают ходы оптимальным образом.
 */
void task_3();

#endif //BASICS_OF_PROGRAMMING_LABORATORY_WORK_1_H