//
// Created by Artyom on 08.10.2023.
//

#ifndef BASICS_OF_PROGRAMMING_LABORATORY_WORK_1_H
#define BASICS_OF_PROGRAMMING_LABORATORY_WORK_1_H

/*
 * Минуты до Нового года 1283A codeforces
 *
 * Новый год уже на подходе и вы настолько взволнованы, что хотите узнать, сколько минут до него
 * осталось. Вы знаете, что сейчас часы показывают время «h часов, m минут», где 0 ≤ hh < 24 и
 * 0 ≤ mm < 60.
 * Ваша задача — найти количество минут до Нового года! Вы знаете, что Новый год наступит, когда часы
 * покажут 0 часов и 0 минут.
 * Вам необходимо ответить на t независимых наборов входных данных.
 */
void task_1();

/*
 * Опять двадцать пять! 630A codeforces
 *
 * HR-менеджер опять был расстроен. Очередной кандидат так же провалил собеседование, как и 24
 * предыдущих. «Неужели я даю такое сложное задание? — думал HR-менеджер. — Всего лишь возвести число
 * 5 в степень n и узнать последние две цифры числа. Да, конечно, n может быть большим, и на
 * калькуляторе такую степень не посчитать, но нам и нужны люди, способные думать, а не только
 * инструкции исполнять.»
 * А вы смогли бы пройти собеседование в компании, занимающейся машинным зрением в ИТ-граде?
 */
void task_2();

/*
 * Игра 513A codeforces
 *
 * Два игрока играют в простую игру. У каждого игрока есть коробка с шарами, причем коробка первого
 * игрока содержит ровно n_1 шаров, а коробка второго игрока содержит ровно n_2 шаров. За один ход
 * первый игрок может взять от 1 до k_1 шаров из своей коробки и выкинуть их. Аналогичным образом, за
 * один ход второй игрок может взять от 1 до k_2 шаров из своей коробки и выкинуть их. Игроки ходят по
 * очереди и первый игрок начинает игру. Проигрывает тот, кто не может сделать ход. Ваша задача
 * определить, кто выигрывает игру, если оба игрока совершают ходы оптимальным образом.
 */
void task_3();

/*
 * Слоник 617A codeforces
 *
 * Слоник решил сходить в гости к другу. Оказалось, что дом слоника находится в точке 0, а дом его
 * друга в точке x(x > 0) координатной прямой. За один шаг слоник может переместиться на 1, 2, 3, 4
 * или 5 позиций вперёд. Помогите ему определить, за какое минимальное количество шагов он может
 * добраться до дома друга.
 */
void task_4();

/*
 * Арбуз 4A codeforces
 *
 * В один из жарких летних дней Петя и его друг Вася решили купить арбуз. Они выбрали самый большой
 * и самый спелый, на их взгляд. После недолгой процедуры взвешивания весы показали w килограмм.
 * Поспешно прибежав домой, изнемогая от жажды, ребята начали делить приобретенную ягоду, однако перед
 * ними встала нелегкая задача. Петя и Вася являются большими поклонниками четных чисел, поэтому хотят
 * поделить арбуз так, чтобы доля каждого весила именно четное число килограмм, при этом не
 * обязательно, чтобы доли были равными по величине. Ребята очень сильно устали и хотят скорее
 * приступить к трапезе, поэтому Вы должны подсказать им, удастся ли поделить арбуз, учитывая их
 * пожелание. Разумеется, каждому должен достаться кусок положительного веса.
 */
void task_5();

/*
 * Покупка воды 1118A codeforces
 *
 * Поликарп хочет приготовить суп. Чтобы это сделать, ему нужно купить ровно n литров воды.
 * В ближайшем магазине есть бутылки с водой только двух типов — 1-литровые бутылки и 2-литровые
 * бутылки. В магазине есть бесконечно много бутылок этих двух типов.
 * Бутылка первого типа стоит a бурлей, а бутылка второго типа стоит b бурлей соответственно.
 * Поликарп хочет потратить минимально возможное количество денег. Ваша задача — найти минимальное
 * количество денег (в бурлях), которое нужно Поликарпу для того, чтобы купить ровно n литров воды
 * в ближайшем магазине, если бутылка первого типа стоит a бурлей, а бутылка второго типа стоит b
 * бурлей.
 * Вам также необходимо ответить на q независимых запросов.
 */
void task_6();

/*
 * Хипстер Вася 581A codeforces
 *
 * Как-то раз хипстер Вася решил посчитать, сколько у него носков. Оказалось, что у Васи есть a
 * красных носков и b синих носков.
 * Согласно последним веяниям моды, хипстеры должны носить носки разных цветов: на левой ноге
 * красный, а на правой — синий.
 * Каждый день с утра Вася надевает новые носки, а перед сном выкидывает их, ведь стирать ему их
 * очень не хочется.
 * Васе стало интересно, какое максимальное количество дней, в которые он сможет быть одетым по моде
 * и носить разноцветные носки, и сколько затем дней он сможет ходить в одноцветных носках, пока
 * носки либо не закончатся, либо из оставшихся носков нельзя будет составить ни одной пары.
 * Поможете ему?
 */
void task_7();

/*
 * Солдат и бананы 546A codeforces
 *
 * Солдат хочет купить w бананов в магазине. Ему надо заплатить k долларов за первый банан,
 * 2k долларов — за второй и так далее (иными словами, за i-й банан надо заплатить i·k долларов).
 * У него есть n долларов. Сколько долларов ему придется одолжить у однополчанина, чтобы купить
 * w бананов?
 */
void task_8();

/*
 * Подсчёт функции 486A codeforces
 *
 * Для положительного целого числа n определим функцию f:

f(n) = -1 + 2 - 3 + .. + (-1)^n n

Ваша задача — посчитать f(n) для данного целого числа n.
 */
void task_9();

/*
 * Освещение парка 1358A codeforces
 *
 * В связи с эпидемией коронавируса власти города обязали жителей соблюдать социальную дистанцию.
 * Мэр города Семён Сергеевич хочет осветить парк Глухарники, чтобы люди даже ночью могли видеть
 * друг друга и соблюдали дистанцию.
 * Парк представляет из себя прямоугольную таблицу состоящую из n строк и m столбцов, где клетки
 * таблицы — площади, а границы между клетками — улицы. Также улицами являются внешние границы.
 * Каждая улица имеет длину 1. Например, у парка размера n = m = 2 всего 12 улиц.
 * Вам поручили разработать план освещения парка. Вы можете ставить фонари в серединах улиц. Фонарь
 * освещает две площади, между которыми он стоит (или только одну площадь, если он стоит на границе
 * парка).
 * Семён Сергеевич хочет потратить на освещение наименьшее возможное количество денег, но также
 * хочет чтобы люди по всему парку держали социальную дистанцию. Поэтому он просит вас узнать,
 * какое минимальное количество фонарей понадобится, чтобы осветить все площади.
 */
void task_10();

/*
 * Ручки и карандаши 1244A codeforces
 *
 * Завтра Поликарпу предстоит очень тяжелый день в университете: в его расписании целых a лекционных
 * занятий и b практических занятий! Как прилежный студент, Поликарп собирается посетить все эти пары.
 * Готовясь к походу в университет, Поликарп задумался, хватит ли ему письменных принадлежностей.
 * Все лекции он пишет ручкой (не карандашом!) от руки; чернил в одной ручке хватает на запись c
 * лекций, после чего они заканчиваются. На практических занятиях Поликарп чертит чертежи карандашом
 * (не ручкой!); одного карандаша хватает на d практических занятий, после чего он полностью
 * стачивается.
 * Пенал Поликарпа вмещает не более k предметов для письма. Поэтому, если Поликарп хочет взять с
 * собой завтра в университет x ручек и y карандашей, они поместятся в пенал только в том случае,
 * если x + y ≤ k.
 * Сейчас Поликарп хочет определить, сколько ручек и карандашей ему нужно взять, чтобы все они
 * влезли в пенал. Помогите ему это сделать, или сообщите, что места в пенале не хватит на
 * письменные принадлежности для всех занятий!
 * Обратите внимание, что минимизировать количество предметов не нужно (но суммарное количество
 * ручек и карандашей не должно превысить k).
 */
void task_11();

/*
 * Блэкджек 104A codeforces
 *
 * Дождливым пасмурным вечером, когда все модули попрятались по ближайшим кафетериям, попивая горячие
 * энергококтейли, вирус Хексадесимал решила пролететь над Мэйнфреймом в поисках Гениальной Идеи. И
 * Гениальная Идея нашлась!
 * Почему бы не создать свой Codeforces, с блэкджеком и другими развлекательными мероприятиями?
 * Наверняка найдется много желающих посетить это прекрасное высококультурное заведение.
 * В Мэйнфрейме в блэкджек играют стандартной колодой из 52-х карт, содержащей 13 значений —
 * 2, 3, 4, 5, 6, 7, 8, 9, 10, валеты, дамы, короли, тузы — каждой из четырех мастей —
 * черви, бубны, трефы и пики. Значения очков каждой карты: от двойки до десятки — соответственно
 * от 2 до 10, у туза — 1 или 11 по желанию игрока, у картинок (король, дама, валет) — 10.
 * Значение очков карты не зависит от масти. Правила игры предельно просты. Игрок получает две карты,
 * если сумма очков этих карт равна n, то игрок победил, иначе — проиграл.
 * Игрок уже получил первую карту — это дама пик. Чтобы оценить шансы на победу, нужно определить,
 * сколько существует способов получить вторую карту так, чтобы сумма очков была равна именно n.
 */
void task_12();

/*
 * Сделай треугольник! 1064A codeforces
 *
 * У Маши есть три палочки длиной a, b и c сантиметров. За одну минуту Маша может увеличить длину
 * любой из палочек на один сантиметр. Ломать палочки не разрешается.
 * За какое минимальное время Маша сможет собрать треугольник положительной площади, сторонами
 * которого будут палочки, если концы палочек должны быть вершинами треугольника?
 */
void task_13();

/*
 * Уравнение 1269A codeforces
 *
 * Назовем положительное целое число составным если у него есть хотя бы один делитель кроме 1 и себя.
 * Например:
 * следующие числа являются составными: 1024, 4, 6, 9;
 * cледующие числа не являются составными: 13, 1, 2, 3, 37.
 * Вам дано положительное целое число n. Найдите два составных числа a, b, что a − b = n.
 * Гарантируется, что это возможно.
 */
void task_14();

/*
 * Компот 746A codeforces
 *
 * У Николая есть a лимонов, b яблок и c груш. Он решил приготовить из них компот. По рецепту фрукты
 * должны быть в соотношении 1 : 2 : 4, то есть на каждый лимон в компоте должно быть ровно 2 яблока
 * и ровно 4 груши. При этом фрукты нельзя измельчать, ломать или разрезать, поэтому в компот
 * обязательно должны попасть целиком фрукты — лимоны, яблоки и груши.
 * Перед вами стоит задача определить максимальное суммарное количество лимонов, яблок и груш, из
 * которых можно сварить компот по рецепту. Возможна ситуация, когда Николай не сможет для
 * приготовления компота использовать ни одного фрукта, в таком случае выведите 0.
 */
void task_15();

/*
 * Кнопочные гонки 835A codeforces
 *
 * Двое решили посоревноваться в набирании текстов на сайте «Кнопочные гонки». Во время соревнования
 * необходимо ввести текст из s символов. Первый участник набирает один символ за v_1 миллисекунд и
 * имеет пинг t_1 миллисекунд. Второй участник набирает один символ за v_2 миллисекунд и имеет пинг
 * t_2 миллисекунд.
 * При соединении с пингом (задержкой) в t миллисекунд соревнование проходит для участника следующим
 * образом:
 * 1. Ровно через t миллисекунд после начала соревнования участник получает текст, который
 * необходимо ввести.
 * 2. Сразу после этого он начинает вводить этот текст.
 * 3. Ровно через t миллисекунд после того, как он перепечатал весь текст, сайт получает информацию
 * об этом.
 * Победителем в соревновании является тот участник, информация об успехе которого пришла раньше.
 * Если информация пришла от обоих участников одновременно, считается, что произошла ничья.
 * По данной длине текста и информации об участниках, определите исход игры.
 */
void task_16();

#endif //BASICS_OF_PROGRAMMING_LABORATORY_WORK_1_H